.text
.globl _strncpy

# dest - a0, src - a1, n - a2
_strncpy:
    mv t0, a2           # Копируем значение n в t0
    li t3, 0            # Загружаем 0 в t3 (будет использоваться для заполнения оставшейся части буфера нулями)
    mv t4, a0           # Сохраняем начальный адрес dest в t4, чтобы вернуть его в конце

loop:
    lb t1, (a1)         # Загружаем байт из src в t1
    beqz t1, fill_zeros    # Если байт равен 0 (конец строки), перейти к заполнению нулями
    sb t1, (a0)         # Иначе сохраняем байт t1 в dest
    addi t0, t0, -1     # n--
    beqz t0, end        # if n == 0 → завершаем
    addi a0, a0, 1      # Увеличиваем указатель dest для перехода к следующему байту
    addi a1, a1, 1      # Увеличиваем указатель src для перехода к следующему байту
    b loop

fill_zeros:
    sb t3, (a0)         # Сохраняем 0 в dest
    addi t0, t0, -1     # n --
    beqz t0, end        # if n == 0 → завершаем
    b padding

end:
    mv a0, t4           # Возвращаем начальный адрес dest в a0
    ret                 # Возвращаемся в вызывающую функцию
