#================================================================================================
# §®§Ñ§Ü§â§à§ã§í §Õ§Ý§ñ §â§Ñ§Ò§à§ä§í §ã §æ§Ñ§Û§Ý§Ñ§Þ§Ú
#================================================================================================

#------------------------------------------------------------------------------------------------
# §°§ä§Ü§â§í§ä§Ú§Ö §æ§Ñ§Û§Ý§Ñ §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ, §Ù§Ñ§á§Ú§ã§Ú, §Õ§à§á§à§Ý§ß§Ö§ß§Ú§ñ
.eqv READ_ONLY	0	# §°§ä§Ü§â§í§ä§î §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ
.eqv WRITE_ONLY	1	# §°§ä§Ü§â§í§ä§î §Õ§Ý§ñ §Ù§Ñ§á§Ú§ã§Ú
.eqv APPEND	9	# §°§ä§Ü§â§í§ä§î §Õ§Ý§ñ §Õ§à§Ò§Ñ§Ó§Ý§Ö§ß§Ú§ñ
.macro open(%file_name, %opt)
    li   	a7 1024     	# §³§Ú§ã§ä§Ö§Þ§ß§í§Û §Ó§í§Ù§à§Ó §à§ä§Ü§â§í§ä§Ú§ñ §æ§Ñ§Û§Ý§Ñ
    la      	a0 %file_name   	# §ª§Þ§ñ §à§ä§Ü§â§í§Ó§Ñ§Ö§Þ§à§Ô§à §æ§Ñ§Û§Ý§Ñ
    li   	a1 %opt        	# §°§ä§Ü§â§í§ä§î §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ (§æ§Ý§Ñ§Ô = 0)
    ecall             		# §¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ §Ó a0 §Ú§Ý§Ú -1)
.end_macro

#------------------------------------------------------------------------------------------------
# §¹§ä§Ö§ß§Ú§Ö §Ú§ß§æ§à§â§Þ§Ñ§è§Ú§Ú §Ú§Ù §à§ä§Ü§â§í§ä§à§Ô§à §æ§Ñ§Û§Ý§Ñ
.macro read(%file_descriptor, %strbuf, %size)
    li   a7, 63       		# §³§Ú§ã§ä§Ö§Þ§ß§í§Û §Ó§í§Ù§à§Ó §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ §Ú§Ù §æ§Ñ§Û§Ý§Ñ
    mv   a0, %file_descriptor      # §¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ
    mv   a1, %strbuf   		# §¡§Õ§â§Ö§ã §Ò§å§æ§Ö§â§Ñ §Õ§Ý§ñ §é§Ú§ä§Ñ§Ö§Þ§à§Ô§à §ä§Ö§Ü§ã§ä§Ñ
    mv   a2, %size 		# §²§Ñ§Ù§Þ§Ö§â §é§Ú§ä§Ñ§Ö§Þ§à§Û §á§à§â§è§Ú§Ú
    ecall             		# §¹§ä§Ö§ß§Ú§Ö
.end_macro

#------------------------------------------------------------------------------------------------
# §¹§ä§Ö§ß§Ú§Ö §Ú§ß§æ§à§â§Þ§Ñ§è§Ú§Ú §Ú§Ù §à§ä§Ü§â§í§ä§à§Ô§à §æ§Ñ§Û§Ý§Ñ,
# §Ü§à§Ô§Õ§Ñ §Ñ§Õ§â§Ö§ã §Ò§å§æ§Ö§â§Ñ §Ó §â§Ö§Ô§Ú§ã§ä§â§Ö
.macro read_addr_reg(%file_descriptor, %reg, %size)
    li   a7, 63       		# §³§Ú§ã§ä§Ö§Þ§ß§í§Û §Ó§í§Ù§à§Ó §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ §Ú§Ù §æ§Ñ§Û§Ý§Ñ
    mv   a0, %file_descriptor      # §¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ
    mv   a1, %reg   		# §¡§Õ§â§Ö§ã §Ò§å§æ§Ö§â§Ñ §Õ§Ý§ñ §é§Ú§ä§Ñ§Ö§Þ§à§Ô§à §ä§Ö§Ü§ã§ä§Ñ §Ú§Ù §â§Ö§Ô§Ú§ã§ä§â§Ñ
    li   a2, %size 		# §²§Ñ§Ù§Þ§Ö§â §é§Ú§ä§Ñ§Ö§Þ§à§Û §á§à§â§è§Ú§Ú
    ecall             		# §¹§ä§Ö§ß§Ú§Ö
.end_macro

#------------------------------------------------------------------------------------------------
# §©§Ñ§á§Ú§ã§î §Ó §à§ä§Ü§â§í§ä§í§Û §æ§Ñ§Û§Ý
# §±§Ñ§â§Ñ§Þ§Ö§ä§â§í:
#    %file_descriptor - §Õ§Ö§ã§Ü§â§Ú§á§ä§à§â §Ó§í§ç§à§Õ§ß§à§Ô§à §æ§Ñ§Û§Ý§Ñ
#    %reg - §Ñ§Õ§â§Ö§ã §ß§Ñ§é§Ñ§Ý§Ñ §Ò§å§æ§Ö§â§Ñ
#    %size_reg - §Ü§à§Ý§Ú§é§Ö§ã§ä§Ó§à §Ò§Ñ§Û§ä§à§Ó §Õ§Ý§ñ §Ù§Ñ§á§Ú§ã§Ú
.macro write_addr(%file_descriptor, %reg, %size_reg)
    li   a7 64              # §³§Ú§ã§ä§Ö§Þ§ß§í§Û §Ó§í§Ù§à§Ó §Õ§Ý§ñ §Ù§Ñ§á§Ú§ã§Ú §Ó §æ§Ñ§Û§Ý
    mv   a0 %file_descriptor
    mv   a1 %reg
    mv   a2 %size_reg
    ecall
.end_macro

#------------------------------------------------------------------------------------------------
# §©§Ñ§Ü§â§í§ä§Ú§Ö §æ§Ñ§Û§Ý§Ñ
.macro close(%file_descriptor)
    li   a7, 57       		# §³§Ú§ã§ä§Ö§Þ§ß§í§Û §Ó§í§Ù§à§Ó §Ù§Ñ§Ü§â§í§ä§Ú§ñ §æ§Ñ§Û§Ý§Ñ
    mv   a0, %file_descriptor  	# §¥§Ö§ã§Ü§â§Ú§á§ä§à§â §æ§Ñ§Û§Ý§Ñ
    ecall            		# §©§Ñ§Ü§â§í§ä§Ú§Ö §æ§Ñ§Û§Ý§Ñ
.end_macro