#================================================================================================
# §®§Ñ§Ü§â§à§ã§í §Õ§Ý§ñ §â§Ñ§Ò§à§ä§í §ã §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§í§Þ§Ú §à§Ü§ß§Ñ§Þ§Ú
#================================================================================================

#------------------------------------------------------------------------------------------------
# §£§í§Ù§à§Ó §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ô§à §à§Ü§ß§Ñ §Õ§Ý§ñ §á§à§Ý§å§é§Ö§ß§Ú§ñ §ã§ä§â§à§Ü§Ú
# §à§ä §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ
# §±§Ñ§â§Ñ§Þ§Ö§ä§â§í:
#    %message - §Ñ§Õ§â§Ö§ã §ã§ä§â§à§Ü§Ú §ã§à§à§Ò§ë§Ö§ß§Ú§ñ §Õ§Ý§ñ §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ñ (null-terminated)
#    %buffer - §Ñ§Õ§â§Ö§ã §Ò§å§æ§Ö§â§Ñ §Õ§Ý§ñ §ã§à§ç§â§Ñ§ß§Ö§ß§Ú§ñ §Ó§Ó§à§Õ§Ñ
#    %symbols_count - §Þ§Ñ§Ü§ã§Ú§Þ§Ñ§Ý§î§ß§à§Ö §Ü§à§Ý§Ú§é§Ö§ã§ä§Ó§à §ã§Ú§Þ§Ó§à§Ý§à§Ó §Õ§Ý§ñ §é§ä§Ö§ß§Ú§ñ (§Ó§Ü§Ý§ð§é§Ñ§ñ §Ù§Ñ§Ó§Ö§â§ê§Ñ§ð§ë§Ú§Û null)
.macro input_string_dialog(%message, %buffer, %symbols_count)
    	la a0 %message          	# §±§Ö§â§Ö§Õ§Ñ§Ö§Þ §Ñ§Õ§â§Ö§ã §ã§à§à§Ò§ë§Ö§ß§Ú§ñ §Ó a0
    	la a1 %buffer         	# §±§Ö§â§Ö§Õ§Ñ§Ö§Þ §Ñ§Õ§â§Ö§ã §Ò§å§æ§Ö§â§Ñ §Ó a1
    	li a2 %symbols_count
    	jal ra input_string_dialog
.end_macro

#------------------------------------------------------------------------------------------------
# §£§í§Ù§à§Ó §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ô§à §à§Ü§ß§Ñ §Õ§Ý§ñ §Ó§í§Ó§à§Õ§Ñ §ã§à§à§Ò§ë§Ö§ß§Ú§ñ
# §±§Ñ§â§Ñ§Þ§Ö§ä§â§í:
#    %message - §Ñ§Õ§â§Ö§ã §ã§ä§â§à§Ü§Ú §ã§à§à§Ò§ë§Ö§ß§Ú§ñ, §Ü§à§ä§à§â§à§Ö §Ò§å§Õ§Ö§ä §à§ä§à§Ò§â§Ñ§Ø§Ö§ß§à §á§à§Ý§î§Ù§à§Ó§Ñ§ä§Ö§Ý§ð (null-terminated)
#    %type - the type of the message to the user, which is one of: 
#	0: error message
#	1: information message 
#	2: warning message 
#	3: question message 
#	other: plain message
.macro message_dialog(%message, %type)
    	la a0 %message          # §±§Ö§â§Ö§Õ§Ñ§Ö§Þ §Ñ§Õ§â§Ö§ã §ã§à§à§Ò§ë§Ö§ß§Ú§ñ §Ó a0
    	li a1 %type         	# §±§Ö§â§Ö§Õ§Ñ§Ö§Þ §ä§Ú§á §à§Ü§ß§Ñ §Ó a1
    	jal ra message_dialog
.end_macro

#------------------------------------------------------------------------------------------------
# §£§í§Ù§à§Ó §Õ§Ú§Ñ§Ý§à§Ô§à§Ó§à§Ô§à §à§Ü§ß§Ñ §Õ§Ý§ñ §Ó§í§Ò§à§â§Ñ Yes/No
# §±§Ñ§â§Ñ§Þ§Ö§ä§â§í:
#    %message - address of null-terminated string that is the message to user
.macro confirm_dialog(%message)
    	la a0 %message          # §±§Ö§â§Ö§Õ§Ñ§Ö§Þ §Ñ§Õ§â§Ö§ã §ã§à§à§Ò§ë§Ö§ß§Ú§ñ §Ó a0
    	jal ra confirm_dialog
.end_macro