#================================================================================================
# Макросы для работы с файлами
#================================================================================================

#------------------------------------------------------------------------------------------------
# Открытие файла для чтения, записи, дополнения
.eqv READ_ONLY	0	# Открыть для чтения
.eqv WRITE_ONLY	1	# Открыть для записи
.eqv APPEND	9	# Открыть для добавления
.macro open(%file_name, %opt)
    li   	a7 1024     	# Системный вызов открытия файла
    la      	a0 %file_name   	# Имя открываемого файла
    li   	a1 %opt        	# Открыть для чтения (флаг = 0)
    ecall             		# Дескриптор файла в a0 или -1)
.end_macro

#------------------------------------------------------------------------------------------------
# Чтение информации из открытого файла
.macro read(%file_descriptor, %strbuf, %size)
    li   a7, 63       		# Системный вызов для чтения из файла
    mv   a0, %file_descriptor      # Дескриптор файла
    mv   a1, %strbuf   		# Адрес буфера для читаемого текста
    mv   a2, %size 		# Размер читаемой порции
    ecall             		# Чтение
.end_macro

#------------------------------------------------------------------------------------------------
# Чтение информации из открытого файла,
# когда адрес буфера в регистре
.macro read_addr_reg(%file_descriptor, %reg, %size)
    li   a7, 63       		# Системный вызов для чтения из файла
    mv   a0, %file_descriptor      # Дескриптор файла
    mv   a1, %reg   		# Адрес буфера для читаемого текста из регистра
    li   a2, %size 		# Размер читаемой порции
    ecall             		# Чтение
.end_macro

#------------------------------------------------------------------------------------------------
# Запись в открытый файл
# Параметры:
#    %file_descriptor - дескриптор выходного файла
#    %reg - адрес начала буфера
#    %size_reg - количество байтов для записи
.macro write_addr(%file_descriptor, %reg, %size_reg)
    li   a7 64              # Системный вызов для записи в файл
    mv   a0 %file_descriptor
    mv   a1 %reg
    mv   a2 %size_reg
    ecall
.end_macro

#------------------------------------------------------------------------------------------------
# Закрытие файла
.macro close(%file_descriptor)
    li   a7, 57       		# Системный вызов закрытия файла
    mv   a0, %file_descriptor  	# Дескриптор файла
    ecall            		# Закрытие файла
.end_macro
